---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.IndexTriangle
source: html/7afbf566-f422-3110-8d66-19c83b3403b3.htm
---
# IndexTriangle Properties

The index of the triangle's first vertex.